{
    "soái ca": "“Soái ca” is a term used to describe a man who is exceptionally handsome, chivalrous, and perfect in almost every way. It is often used in the context of romantic stories or to describe an ideal boyfriend. For instance, “Anh ấy đúng là soái ca” means “He is truly a perfect guy.”",
    "đỉnh": "One of the most popular slang terms among Vietnamese Gen Z is “đỉnh.” Literally translated, “đỉnh” means “peak” or “top.” However, in the context of slang, it is used to describe something or someone that is excellent or outstanding. For example, if a movie is exceptionally good, a Vietnamese Gen Z might say, “Bộ phim này đỉnh quá!” which means “This movie is awesome!”",
    "xõa": "The term “xõa” is another favorite among the youth. It means to let loose or to have fun without any worries. It is commonly used when talking about unwinding after a stressful period. For instance, after a week of exams, a student might say, “Cuối tuần này xõa đi!” translating to “Let’s have fun this weekend!”",
    "lầy": "“Lầy” is an interesting slang term that can describe someone who is playful or mischievous in a stubborn way. It often has a humorous connotation, and it is used to describe someone who keeps pushing boundaries in a playful manner. For example, if a friend keeps teasing you, you might say, “Cậu lầy quá,” meaning “You are so playful/mischievous.”",
    "chất": "“Chất” is a versatile slang term that can be used to describe something that is cool, stylish, or impressive. It is often used to compliment someone’s fashion sense, music taste, or even a well-executed plan. For instance, “Bộ đồ này chất quá” translates to “This outfit is so cool.”",
    "gato": "“Gato” gradually became a popular word with many people when saying it in certain conversations. Gato is an abbreviation of the word “jealousy”, meaning the state of being jealous or envious of others.",
    "bánh bèo": "“Bánh bèo” is a term that literally translates to a type of Vietnamese cake made from rice flour. However, in slang, it is used to describe a girl who is overly feminine or delicate. It can be used both positively and negatively, depending on the context. For example, “Cô ấy bánh bèo quá” could mean “She is so girly” in a neutral or affectionate sense.",
    "cày": "“Cày” literally means “to plow,” but in slang, it refers to studying or working extremely hard. It is often used by students who are preparing for exams or by people who are putting in long hours at work. For example, “Mình phải cày cả đêm nay” means “I have to work/study all night.”",
    "dizz": "“Dizz” is a Vietnamese adaptation of the English word “diss,” which means to disrespect or criticize someone. It is often used in the context of online arguments or rap battles. For instance, “Anh ấy dizz mình trên mạng” translates to “He dissed me online.”",
    "sml": "“Sml” is an abbreviation that stands for “sấp mặt luôn,” which loosely translates to “falling flat on one’s face.” It is used to describe a situation where someone fails miserably or experiences something extremely challenging. For example, “Mình bị điểm kém sml” means “I got a terrible grade and it was so bad.”",
    "ối dồi ôi": "Vietnamese people frequently use this to express bewilderment, surprise, etc",
    "bó tay": "When we find ourselves in an awkward situation and cannot solve the problem, Vietnamese come up with this funny and interesting phrase “Give up.”",
    "biết chết liền": "“Biết chết liền” is used when the speaker is lack of information or is unaware of the subject being discussed. Simply  being understood as “I don’t know”.",
    "sao phải xoắn": "This phrase is used by numerous people and is listed in the Vietnamese slang dictionary.",
    "toang": "“Toang” is one of Vietnamese slang words often used as a joke in  daily conversation amongst friends or close colleagues.",
    "chảnh": "In Vietnamese slangs, the word “chảnh” is an adjective frequently being used to identify someone who is:",
    "trẻ trâu": "“Trẻ trâu” is used for the purpose of describing people who are childish, unruly, impulsive, hasty, and immature.",
    "chém gió": "“Chém gió” is understood in many ways, often tends to fabricate or exaggerate a part of the story.",
    "trăm phần trăm": "This phrase is often used when going out to drink, you clink your cups and shout “Trăm phần trăm!”. This means that you will have to finish your glass in one shot.",
    "chán như con gián": "Obviously cockroach and “boring” are not related, but in Vietnamese, these two words have the same finish pronunciation, so people use this phrase to express boredom.",
    "giận tím người": "“Giận” is “angry”, “tím” is “purple”, “người” is “body” and “giận tím người” means that  person becomes too angry. This is an exciting way of saying, showing that I am very angry but just joking.",
    "u là trời": "One of the many intriguing words used by Gen Z everyday, “u là trời” is explained as follows:",
    "còn cái nịt": "Starting with a YouTube comment from a character, genZ quickly updated the dictionary with an exciting word to use everyday.",
    "khum": "“Khum” appeared from comments on social media posts and is gradually being used as a slang word on daily communication by Gen Z.",
    "ét o ét": "The source of thes trend “ét o ét” comes from Ms. Toan Vlog’s Tiktok channel. “Ét o ét” is actually:",
    "ố dề": "Just like “còn cái nịt” and “ét o ét”, “ố dề” has appeared as an Internet trend through a clip on Tiktok. When you read the word “ố dề” quickly, it will have the same pronunciation as the word “Oh yeah!” in English.",
    "ủa": "In daily communication, “uả” is a word often used to express surprise and skepticism in what we see and hear.",
    "gét gô": "“Gét gô” which also comes from Tiktok channels, is one of the top slang words supported and used by Gen Z.",
    "lemỏn": "Looking at the word “lemỏn”, surely you will immediately think of the word “lemon” in English, right? Yes, you are correct.",
    "gấu": "“Bear” is no longer just an animal but has now become a noun used to refer to a lover in a cute way. Young Vietnamese often use this word."
}